 gcc -g p1original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x81a: file p1original.c, line 17.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:17
17  {
(gdb) s
19    input(&base,&height);
(gdb) s
input (base=0x7fff50ccd3bc, height=0x7fff50ccd3c0) at p1original.c:4
4     printf("Enter two values\n");
(gdb) n
Enter two values
5     scanf("%f%f",base,height);
(gdb) n
1
2
6   }
(gdb) p *base
$1 = 1
(gdb) p *height
$2 = 2
(gdb) n
main () at p1original.c:20
20    find_area(base,height,&area);
(gdb) s
find_area (base=1, height=2, area=0x7fff50ccd3c4) at p1original.c:9
9     *area = (base * height)/2;
(gdb) n
10  }
(gdb) p *area
$3 = 1
(gdb) n
main () at p1original.c:21
21    output(base,height,area);
(gdb) s
output (base=1, height=2, area=1) at p1original.c:14
14    printf("the area of triangle with %f and  %f is %f\n",base,height,area);
(gdb) n
the area of triangle with 1.000000 and  2.000000 is 1.000000
15  }
(gdb) n
main () at p1original.c:22
22    return 0;
(gdb) n
23  }(gdb) c
Continuing.
[Inferior 1 (process 927) exited normally]
(gdb) 
